Revit 2026 API

# PhotometricWebLightDistribution(PhotometricWebLightDistribution) Constructor

---

Creates a copy of the given photometric web light distribution

**Namespace:** Autodesk.Revit.DB.Lighting**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public PhotometricWebLightDistribution(
	PhotometricWebLightDistribution other
)
```
```vb
Public Sub New (
	other As PhotometricWebLightDistribution
)
```
```cpp
public:
PhotometricWebLightDistribution(
	PhotometricWebLightDistribution^ other
)
```
```fsharp
new :
        other : PhotometricWebLightDistribution -> PhotometricWebLightDistribution
```

#### Parameters

other PhotometricWebLightDistribution

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

PhotometricWebLightDistribution Class

PhotometricWebLightDistribution Overload

Autodesk.Revit.DB.Lighting Namespace